{
  "nodes": [
    {
      "op": "null", 
      "param": {}, 
      "name": "data", 
      "inputs": [], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn_data_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn_data_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "bn_data", 
      "inputs": [[0, 0], [1, 0], [2, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv0_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(7,7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(3,3)", 
        "stride": "(2,2)", 
        "workspace": "512"
      }, 
      "name": "conv0", 
      "inputs": [[3, 0], [4, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn0_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn0_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "bn0", 
      "inputs": [[5, 0], [6, 0], [7, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "relu0", 
      "inputs": [[8, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Pooling", 
      "param": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(1,1)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "name": "pooling0", 
      "inputs": [[9, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit1_bn1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit1_bn1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage1_unit1_bn1", 
      "inputs": [[10, 0], [11, 0], [12, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage1_unit1_relu1", 
      "inputs": [[13, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit1_conv1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage1_unit1_conv1", 
      "inputs": [[14, 0], [15, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit1_bn2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit1_bn2_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage1_unit1_bn2", 
      "inputs": [[16, 0], [17, 0], [18, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage1_unit1_relu2", 
      "inputs": [[19, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit1_conv2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage1_unit1_conv2", 
      "inputs": [[20, 0], [21, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit1_bn3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit1_bn3_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage1_unit1_bn3", 
      "inputs": [[22, 0], [23, 0], [24, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage1_unit1_relu3", 
      "inputs": [[25, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit1_conv3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage1_unit1_conv3", 
      "inputs": [[26, 0], [27, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit1_sc_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage1_unit1_sc", 
      "inputs": [[14, 0], [29, 0]], 
      "backward_source_id": -1, 
      "attr": {
        "force_mirroring": "True", 
        "mirror_stage": "True"
      }
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus0", 
      "inputs": [[28, 0], [30, 0]], 
      "backward_source_id": -1, 
      "attr": {
        "force_mirroring": "True", 
        "mirror_stage": "True"
      }
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit2_bn1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit2_bn1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage1_unit2_bn1", 
      "inputs": [[31, 0], [32, 0], [33, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage1_unit2_relu1", 
      "inputs": [[34, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit2_conv1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage1_unit2_conv1", 
      "inputs": [[35, 0], [36, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit2_bn2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit2_bn2_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage1_unit2_bn2", 
      "inputs": [[37, 0], [38, 0], [39, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage1_unit2_relu2", 
      "inputs": [[40, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit2_conv2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage1_unit2_conv2", 
      "inputs": [[41, 0], [42, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit2_bn3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit2_bn3_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage1_unit2_bn3", 
      "inputs": [[43, 0], [44, 0], [45, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage1_unit2_relu3", 
      "inputs": [[46, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit2_conv3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage1_unit2_conv3", 
      "inputs": [[47, 0], [48, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus1", 
      "inputs": [[49, 0], [31, 0]], 
      "backward_source_id": -1, 
      "attr": {
        "force_mirroring": "False", 
        "mirror_stage": "True"
      }
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit3_bn1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit3_bn1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage1_unit3_bn1", 
      "inputs": [[50, 0], [51, 0], [52, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage1_unit3_relu1", 
      "inputs": [[53, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit3_conv1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage1_unit3_conv1", 
      "inputs": [[54, 0], [55, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit3_bn2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit3_bn2_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage1_unit3_bn2", 
      "inputs": [[56, 0], [57, 0], [58, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage1_unit3_relu2", 
      "inputs": [[59, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit3_conv2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage1_unit3_conv2", 
      "inputs": [[60, 0], [61, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit3_bn3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit3_bn3_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage1_unit3_bn3", 
      "inputs": [[62, 0], [63, 0], [64, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage1_unit3_relu3", 
      "inputs": [[65, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage1_unit3_conv3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage1_unit3_conv3", 
      "inputs": [[66, 0], [67, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus2", 
      "inputs": [[68, 0], [50, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit1_bn1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit1_bn1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit1_bn1", 
      "inputs": [[69, 0], [70, 0], [71, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit1_relu1", 
      "inputs": [[72, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit1_conv1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit1_conv1", 
      "inputs": [[73, 0], [74, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit1_bn2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit1_bn2_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit1_bn2", 
      "inputs": [[75, 0], [76, 0], [77, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit1_relu2", 
      "inputs": [[78, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit1_conv2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(2,2)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit1_conv2", 
      "inputs": [[79, 0], [80, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit1_bn3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit1_bn3_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit1_bn3", 
      "inputs": [[81, 0], [82, 0], [83, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit1_relu3", 
      "inputs": [[84, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit1_conv3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit1_conv3", 
      "inputs": [[85, 0], [86, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit1_sc_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(2,2)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit1_sc", 
      "inputs": [[73, 0], [88, 0]], 
      "backward_source_id": -1, 
      "attr": {
        "force_mirroring": "True", 
        "mirror_stage": "True"
      }
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus3", 
      "inputs": [[87, 0], [89, 0]], 
      "backward_source_id": -1, 
      "attr": {
        "force_mirroring": "True", 
        "mirror_stage": "True"
      }
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit2_bn1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit2_bn1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit2_bn1", 
      "inputs": [[90, 0], [91, 0], [92, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit2_relu1", 
      "inputs": [[93, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit2_conv1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit2_conv1", 
      "inputs": [[94, 0], [95, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit2_bn2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit2_bn2_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit2_bn2", 
      "inputs": [[96, 0], [97, 0], [98, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit2_relu2", 
      "inputs": [[99, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit2_conv2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit2_conv2", 
      "inputs": [[100, 0], [101, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit2_bn3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit2_bn3_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit2_bn3", 
      "inputs": [[102, 0], [103, 0], [104, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit2_relu3", 
      "inputs": [[105, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit2_conv3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit2_conv3", 
      "inputs": [[106, 0], [107, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus4", 
      "inputs": [[108, 0], [90, 0]], 
      "backward_source_id": -1, 
      "attr": {
        "force_mirroring": "False", 
        "mirror_stage": "True"
      }
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit3_bn1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit3_bn1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit3_bn1", 
      "inputs": [[109, 0], [110, 0], [111, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit3_relu1", 
      "inputs": [[112, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit3_conv1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit3_conv1", 
      "inputs": [[113, 0], [114, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit3_bn2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit3_bn2_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit3_bn2", 
      "inputs": [[115, 0], [116, 0], [117, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit3_relu2", 
      "inputs": [[118, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit3_conv2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit3_conv2", 
      "inputs": [[119, 0], [120, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit3_bn3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit3_bn3_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit3_bn3", 
      "inputs": [[121, 0], [122, 0], [123, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit3_relu3", 
      "inputs": [[124, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit3_conv3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit3_conv3", 
      "inputs": [[125, 0], [126, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus5", 
      "inputs": [[127, 0], [109, 0]], 
      "backward_source_id": -1, 
      "attr": {
        "force_mirroring": "True", 
        "mirror_stage": "True"
      }
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit4_bn1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit4_bn1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit4_bn1", 
      "inputs": [[128, 0], [129, 0], [130, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit4_relu1", 
      "inputs": [[131, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit4_conv1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit4_conv1", 
      "inputs": [[132, 0], [133, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit4_bn2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit4_bn2_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit4_bn2", 
      "inputs": [[134, 0], [135, 0], [136, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit4_relu2", 
      "inputs": [[137, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit4_conv2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit4_conv2", 
      "inputs": [[138, 0], [139, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit4_bn3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit4_bn3_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit4_bn3", 
      "inputs": [[140, 0], [141, 0], [142, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit4_relu3", 
      "inputs": [[143, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit4_conv3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit4_conv3", 
      "inputs": [[144, 0], [145, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus6", 
      "inputs": [[146, 0], [128, 0]], 
      "backward_source_id": -1, 
      "attr": {
        "force_mirroring": "True", 
        "mirror_stage": "True"
      }
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit5_bn1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit5_bn1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit5_bn1", 
      "inputs": [[147, 0], [148, 0], [149, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit5_relu1", 
      "inputs": [[150, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit5_conv1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit5_conv1", 
      "inputs": [[151, 0], [152, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit5_bn2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit5_bn2_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit5_bn2", 
      "inputs": [[153, 0], [154, 0], [155, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit5_relu2", 
      "inputs": [[156, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit5_conv2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit5_conv2", 
      "inputs": [[157, 0], [158, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit5_bn3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit5_bn3_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit5_bn3", 
      "inputs": [[159, 0], [160, 0], [161, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit5_relu3", 
      "inputs": [[162, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit5_conv3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit5_conv3", 
      "inputs": [[163, 0], [164, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus7", 
      "inputs": [[165, 0], [147, 0]], 
      "backward_source_id": -1, 
      "attr": {
        "force_mirroring": "True", 
        "mirror_stage": "True"
      }
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit6_bn1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit6_bn1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit6_bn1", 
      "inputs": [[166, 0], [167, 0], [168, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit6_relu1", 
      "inputs": [[169, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit6_conv1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit6_conv1", 
      "inputs": [[170, 0], [171, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit6_bn2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit6_bn2_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit6_bn2", 
      "inputs": [[172, 0], [173, 0], [174, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit6_relu2", 
      "inputs": [[175, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit6_conv2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit6_conv2", 
      "inputs": [[176, 0], [177, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit6_bn3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit6_bn3_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit6_bn3", 
      "inputs": [[178, 0], [179, 0], [180, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit6_relu3", 
      "inputs": [[181, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit6_conv3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit6_conv3", 
      "inputs": [[182, 0], [183, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus8", 
      "inputs": [[184, 0], [166, 0]], 
      "backward_source_id": -1, 
      "attr": {
        "force_mirroring": "True", 
        "mirror_stage": "True"
      }
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit7_bn1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit7_bn1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit7_bn1", 
      "inputs": [[185, 0], [186, 0], [187, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit7_relu1", 
      "inputs": [[188, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit7_conv1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit7_conv1", 
      "inputs": [[189, 0], [190, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit7_bn2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit7_bn2_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit7_bn2", 
      "inputs": [[191, 0], [192, 0], [193, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "stage2_unit7_relu2", 
      "inputs": [[194, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit7_conv2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "stage2_unit7_conv2", 
      "inputs": [[195, 0], [196, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit7_bn3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "stage2_unit7_bn3_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "stage2_unit7_bn3", 
      "inputs": [[197, 0], [198, 0], [199, 0]], 
      "backward_source_id": -1, 
      "attr": {"force_mirroring": "True"}
    }, 
